{"id":695116,"retrievedAt":"2025-04-25T23:17:54.267Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"","id":695116,"imdb_id":null,"origin_country":["US"],"original_language":"en","original_title":"Siddieqa, Firdaus, Abdallah, Sulayman, Moestafa, Hawwa, Dzoel-kifl","overview":"In Siddieqa, Firdaus, Abdallah, Sulayman, Moestafa, Hawwa, Dzoel-kifl, Joost Conijn follows seven neighbourhood children for a year. The family lives in Amsterdam-West, on the edge of a squatted dock area. They grow up in total freedom. Every day is a new adventure for them: they do not go to school, so they spend their time riding mopeds unhindered, they steal sweets from the petrol station, and they play in the vast dock area until it gets dark. Conijn’s film is a compelling ode to the homo ludens (playing man) and the resistance to society’s encapsulation of an individual. At the same time, it raises questions about the sustainability of these alternative ideals. Not long after the release of the film, the Amsterdam local government intervened, and Child Services took the children away from their father and put them into care. This is the beginning of the end of a modern utopia, and a bitter example of how art can influence real life.","popularity":0.0071,"poster_path":null,"production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":0,"spoken_languages":[],"status":"Released","tagline":"In Siddieqa, Firdaus, Abdallah, Sulayman, Moestafa, Hawwa, Dzoel-kifl, Joost Conijn follows seven neighbourhood children for a year.","title":"Siddieqa, Firdaus, Abdallah, Sulayman, Moestafa, Hawwa, Dzoel-kifl","video":false,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[{"adult":false,"gender":0,"id":1963948,"known_for_department":"Directing","name":"Joost Conijn","original_name":"Joost Conijn","popularity":0,"profile_path":null,"credit_id":"5e9cd9f2680be80026c566f9","department":"Directing","job":"Director"}]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}