{"id":1565538,"retrievedAt":"2025-10-20T11:34:32.649Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":650,"genres":[],"homepage":"http://www.floodmovie.com","id":1565538,"imdb_id":null,"origin_country":["US"],"original_language":"en","original_title":"Flood","overview":"For her first feature, Katy Scoggin returns to her childhood home to strengthen her bond with her religious father. He has devoted much of his life to emphatically refuting the theory of evolution, while she has embraced science since her student days.  Katy encounters her father at a pivotal moment: her sister’s family is moving to the other side of the country, and her parents are going with them. The entire house is in upheaval, turning up family films, children’s Bibles marked with highlighter and photos from Katy’s experimental student days. Confronted with her own childhood, she discovers how the beliefs of other family members have developed.  Katy is not the only one who has difficulty relating to the pater familias. As their lives are packed into boxes, the dynamics between her father, mother, sister and nephew reveal how complex the relationships between people of different generations and different religious beliefs can be, even when they live together so closely.","popularity":0,"poster_path":null,"production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":75,"spoken_languages":[],"status":"Released","tagline":"A filmmaker goes home with her camera to reconnect to her estranged evangelical father. Though things go awkwardly, the camera makes a decent bridge...until the rest of the family weighs in.","title":"Flood","video":false,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}