{"id":1227768,"retrievedAt":"2025-04-26T02:16:59.583Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"https://www.astrafilm.ro/en/2023/film/armstrong-the-adventurous-journey-of-a-mouse-to-the-moon","id":1227768,"imdb_id":null,"origin_country":["US"],"original_language":"en","original_title":"Armstrong – The adventurous journey of a mouse to the moon","overview":"When the night is clear, the inquisitive mouse Armstrong can look at the moon from her attic through a telescope: white and round and unreachable. \"The moon is made of cheese!\" claim the other mice and do not want to know about Armstrong's theory. So he makes a plan to prove that the moon is made of rock, just like the Earth. He will fly there and get a chunk! But how is that supposed to work? A mouse in space ... Fortunately, Armstrong gets help and thus takes on the legacy of the mouse flight pioneers. He constructs a rocket to take him to the moon and back. After weeks of experiments, experiments and failures that cost Armstrong everything - even his beloved attic and the valuable telescope - the time has finally come: the rocket takes off. According to the picture book by Torben Kuhlmann, \"Armstrong\" describes how a furry, four-legged inventor succeeds in the impossible. A small step for the mouse, but a big step for humanity, which is already on its heels.","popularity":0,"poster_path":null,"production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":44,"spoken_languages":[],"status":"Released","tagline":"","title":"Armstrong – The adventurous journey of a mouse to the moon","video":false,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}