{"id":415640,"retrievedAt":"2025-04-25T21:36:31.870Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"http://babiesaremurderedhere.com","id":415640,"imdb_id":null,"origin_country":["US"],"original_language":"en","original_title":"Babies Are Mudered Here","overview":"Some of our dearest co-laborers in the gospel and allies in the fight for life, have produced a very powerful movie called, Babies Are Murdered Here. While there are some segments of the movie that don't reflect Living Waters' preferred tone and approach in handling the sensitive subject matter that it addresses, and while there are also specific portions that we would have preferred to be excluded from the production, we, nonetheless, believe very strongly in the film's intended purpose, and would like to encourage every Christian to watch it. Babies Are Murdered Here is raw, it's gripping, it's riveting, and most importantly, it contains a sobering message that needs to be heeded by the people of God all across the world. We believe that it bears the potential to dramatically transform the current landscape in the fight for life through the proclamation of the gospel. We hope that you will join us in spreading this timely film far and wide.","popularity":0.0071,"poster_path":null,"production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":54,"spoken_languages":[],"status":"Released","tagline":"Babies Are Murdered Here, is the new controversial pro-life documentary that examines the truth about abortion and the single biggest failure of the pro-life movement, not calling abortion what it really is...Murder.","title":"Babies Are Mudered Here","video":false,"vote_average":10,"vote_count":1,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}