{"id":1472909,"retrievedAt":"2025-04-30T11:32:26.093Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":5000,"genres":[],"homepage":"http://lcatpictures.net","id":1472909,"imdb_id":null,"origin_country":["US"],"original_language":"en","original_title":"Bonnie Brae & 6th, Los Angeles","overview":"Bonnie Brae & 6th, Los Angeles explores the intersection of kinship, culinary tradition, and belonging in a portrait of a Guatemalan-specific street vending community. Street vending plays a major role in the cultural identity and history of Los Angeles, where the ubiquitous rainbow umbrellas and tamale carts are seen, heard, and smelled all over the city. On the corner of Bonnie Brae and 6th Street, near MacArthur Park, endless varieties of homemade traditional cuisine are sold day and night to this largely Guatemalan-dominant corridor of the city. Despite street vending becoming legal in 2018 after years of harassment and fines, it remains entrenched in the informal economy with many bureaucratic and economic obstacles preventing vendors from fully complying with updated regulations. Through conversations with the filmmaker, the film highlights the professional and personal lives of four street vendors who are navigating complex layers of transborder identity and longing for home.","popularity":0.0071,"poster_path":null,"production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":29,"spoken_languages":[{"english_name":"Spanish","iso_639_1":"es","name":"Español"}],"status":"Released","tagline":"Through intimate conversations with the filmmaker, 4 Guatemalan street vendors near Los Angeles' MacArthur Park give insight into their lives navigating complex emotional ties to their homeland, along with strong desires to create promising futures.","title":"Bonnie Brae & 6th, Los Angeles","video":true,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}