{"id":305584,"retrievedAt":"2025-04-25T20:53:43.498Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"http://www.jerichosecho.com/","id":305584,"imdb_id":"tt0454852","origin_country":["US"],"original_language":"en","original_title":"Jericho's Echo - Punk Rock In The Holy Land","overview":"Mohawks, stage diving, fists flying. Homemade band t-shirts, circle pits, singalongs. These scenes are not unfamiliar; They have flooded pop culture imagery for over 25 years. The punk rock ethos gains new relevance in Israel, however, when band members' choices are often between picking up a guitar or picking up a gun. Like the country itself, the punk rock music scene in Israel is young, small, and passionate. The bands have differing political views, but they share a struggle for freedom in a country where they feel restricted by religious laws, mandatory military service and an explosive political situation. Looking at the present situation in Israel through the eyes of punk rockers is not a common vantage point, but the voices of these young people will illuminate the thoughts of a generation of disillusioned Israelis who yearn for an end to the bleak politics of war, so that they might live out their dreams.","popularity":0.0071,"poster_path":null,"production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":75,"spoken_languages":[],"status":"Released","tagline":"Rebellious Israeli youth take up the arms of punk rock, loud guitars, and mohawks in the most politically charged area of the world.","title":"Jericho's Echo - Punk Rock In The Holy Land","video":false,"vote_average":7,"vote_count":1,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":"tt0454852","wikidata_id":"Q6592072","facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}