{"id":336913,"retrievedAt":"2025-04-25T21:06:23.412Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"","id":336913,"imdb_id":null,"origin_country":["US","GB"],"original_language":"en","original_title":"I Love Being HIV+","overview":"According to previous media reports, HIV positive men, or \"gift-givers\", who want to transmit the virus to so-called \"bug chasers\" - HIV negative or untested men - do so in an apparently negotiated exchange.  HIV positive Ricky Dyer, who investigates the apparent bug chasing phenomenon for this documentary, says that an air of complacency about the realities of living with the virus may be one reason why infection rates have been rising.  Dyer tries to find out the truth behind the reporting by going online on a gay dating website, saying he is an HIV positive man who wants to talk to bug chasers.  However, Dyer is appalled to find dozens of apparent bug chasers contact him within days saying that they want to be \"pozzed up\" - infected with the virus.  - Bugchasers seek sexual partners who are HIV positive for the purpose of having unprotected sex and becoming HIV positive; giftgivers are HIV positive individuals who comply with the bugchaser's efforts to become infected with HIV.","popularity":0.0071,"poster_path":null,"production_companies":[{"id":3324,"logo_path":"/dqT3yOTlfJRmtvk52Ccd1O6dZ0A.png","name":"BBC","origin_country":"GB"}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"}],"release_date":"2006-04-10","revenue":0,"runtime":55,"spoken_languages":[],"status":"Released","tagline":"I Love Being HIV+, HIV, i love being HIV, gift, giver, bug, chaser, negative, positive, Ricky Dyer, phenomenon, infection, rate, gay, dating, website, virus, bugchaser, documentary, free, watch, online, download, movie, film, BBC, Richard Pendry","title":"I Love Being HIV+","video":false,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[]},"keywords":{"keywords":[]},"release_dates":{"results":[{"iso_3166_1":"GB","release_dates":[{"certification":"","descriptors":[],"iso_639_1":"","note":"","release_date":"2006-04-10T00:00:00.000Z","type":3}]}]},"videos":{"results":[]}}}