{"id":1625517,"retrievedAt":"2026-01-30T11:47:16.198Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"","id":1625517,"imdb_id":null,"origin_country":["US"],"original_language":"en","original_title":"HOMELESS","overview":"HOMELESS is a documentary that humanizes unhoused people and explores their backgrounds, dreams and struggles to find the way home. The film aims to raise awareness and funds to end homelessness, which is an ever more urgent global challenge: The United Nations Human Settlements Program estimates that 1.6 billion people live in inadequate housing, and the best available data suggests that more than 100 million people have no housing at all.  HOMELESS includes segments with U.S. President Joe Biden, the mayors of Los Angeles and New York City, the HUD secretary, the FBI director, and prominent homelessness advocates. Above all, the film follows the stories of five homeless individuals, who ended up living on the street and losing hope – especially in themselves. With the power of their words and emotions, they take us on an intimate journey that challenges us to go beyond stereotypes and to stop treating them as if they were less than human.","popularity":0,"poster_path":null,"production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":1,"spoken_languages":[],"status":"Released","tagline":"The documentary HOMELESS humanizes unhoused people and explores their struggles to find the way home. It features President Biden, the mayors of L.A. and NYC, and prominent advocates. The film aims to raise awareness to end homelessness.","title":"HOMELESS","video":false,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}