{"id":777900,"retrievedAt":"2025-04-25T23:47:19.497Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"","id":777900,"imdb_id":null,"origin_country":["US"],"original_language":"en","original_title":"Osage Murders","overview":"In 1921 the Osage Tribe of Oklahoma sat on the largest oil field in the world and, because of the wisdom of their elders, each member of the tribe enjoyed a share of the vast fortune.  They became known as the richest people in the world.  Mainstream America read in national publications about how the Osage squandered their money.  The Osage Allotment Act provided the opening many whites needed to cheat the Osage out of their wealth.  Under the Act, white guardians were appointed and then proceeded to rob their wards.  Scams, robbery and even murder went un-investigated.  After all, the Osages did nothing to earn their riches.  The silence of decades has done little to relieve the suspicion and enmity between the Osage and their white neighbors.  No one talks about it; or even acknowledges that it happened.  The Osage people want this story told so that we don’t forget that racism and corruption are still powerful forces in 21st century America.","popularity":0.0143,"poster_path":null,"production_companies":[],"production_countries":[],"release_date":"2007-01-01","revenue":0,"runtime":14,"spoken_languages":[],"status":"Released","tagline":"The story of how the Osage became known as the wealthiest people in the world, and how they were murdered for their money.","title":"Osage Murders","video":false,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[]},"keywords":{"keywords":[]},"release_dates":{"results":[{"iso_3166_1":"US","release_dates":[{"certification":"","descriptors":[],"iso_639_1":"","note":"","release_date":"2007-01-01T00:00:00.000Z","type":4}]}]},"videos":{"results":[]}}}