{"id":148337,"retrievedAt":"2025-04-25T20:08:52.263Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[{"id":10402,"name":"Music"}],"homepage":"","id":148337,"imdb_id":"","origin_country":["US"],"original_language":"en","original_title":"The Greatest Jazz Films Ever","overview":"A compilation of some of the finest documentary footage of jazz greats, this collection features LIFE photographer Gjon Mili's Oscar-winning short \"Jammin' the Blues,\" documenting a 1944 jam session that took place in Hollywood.  Jammin' The Blues: featuring Lester Young, Harry Edison, Illinois Jacquet, Barney Kessel, Jo Jones and others. Be Bop's Nest: The only Charlie Parker television appearance on Stage Enterance, with Dizzy Gillespie and others. The Sound of Miles Davis (Complete Edition): The exemplary television programme featuring the Miles Davis Quintet with John Coltrane, Wynton Kelly, Paul Chambers and Jimmy Cobb - plus the Gil Evans Orchestra. The Sound of Jazz (Complete Edition): a great television show featuring Billie Holiday, Lester Young, Thelonious Monk Trio and many more. Jazz from Studio 61: with Ahmad Jamal Trio and the Ben Webster Quintet accompanied by Buck Clayton, Hank Jones, Vic Dickenson, George Duvivier and Jo Jones.","popularity":0,"poster_path":"/A5aO3EIxGkfVSSW6pRW3SVadw4u.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"release_date":"2008-01-09","revenue":0,"runtime":120,"spoken_languages":[],"status":"Released","tagline":"","title":"The Greatest Jazz Films Ever","video":true,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":"","wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[{"aspect_ratio":0.75,"height":1600,"iso_639_1":"en","file_path":"/A5aO3EIxGkfVSSW6pRW3SVadw4u.jpg","vote_average":3.334,"vote_count":1,"width":1200},{"aspect_ratio":0.75,"height":1600,"iso_639_1":"en","file_path":"/dAKWrPrbaVGvKrgMq1vwVRSuu1J.jpg","vote_average":0,"vote_count":0,"width":1200}]},"keywords":{"keywords":[]},"release_dates":{"results":[{"iso_3166_1":"US","release_dates":[{"certification":"","descriptors":[],"iso_639_1":"en","note":"(2-DVD) Tracklisting: Disc 1: Jammin' The Blues 01 The Midnight Symphony 02 On The Sunny Side Of The Street 03 Jammin' The Blues  Be Bop's Nest 04 Hot House  The Sound Of Miles Davids 05 So What 06 The Duke 07 Blues For Pablo 08 New Rhumba  Bonus Songs: 09 Sweet Georgia Brown 10 If I Could Be With You One Hour Tonight 11 Blues For Marvin 12 Jammin' The Blues - alternate take  Disc 2: The Sound of Jazz (Complete Edition): 01 Open All Night / Blues 02 The Count Blues 03 Wild Man Blues 04 Rosetta 05 Dickie's Dream 06 Blues Monk 07 I Left My Baby 08 Fine And Mellow 09 The Train And The River 10 Blues My Naughty Sweetie Gives To Me  Jazz From Studio 61: 11 Darn That Dream 12 Ahmad's Blues 13 Chelsea Bridge 14 Duke's Place ","release_date":"2008-01-09T00:00:00.000Z","type":4}]}]},"videos":{"results":[]}}}