{"id":1622294,"retrievedAt":"2026-01-25T11:39:03.188Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"https://www.lambfilms.com/film-code-brown.php","id":1622294,"imdb_id":null,"origin_country":["US"],"original_language":"en","original_title":"Code Brown","overview":"Fresh out of university and brimming with optimism, Sean and Lucy begin their civil service placements at Lagan City Council, only to find themselves thrust into chaos when a bizarre gastrointestinal epidemic — dubbed \"Code Brown\" — strikes the city. As nappies become black-market currency and the council descends into disarray, the duo stumbles upon a conspiracy involving illegal sewage dumping and a corrupt councilor lining his pockets. What began as mundane office work spirals into a frantic investigation to find out who’s responsible for this ecological disaster.  With Belfast quite literally in the shit, it’s not the bureaucrats who save the day, but its citizens. From disinfectant-wielding grannies to paramedics in DIY hazmat suits, the community rallies with resilience and absurdity. In a climactic council showdown — punctuated by an explosive display from local wildlife — Sarah and Michael expose the scandal, becoming unlikely heroes.","popularity":0.0071,"poster_path":"/qSGi6RfFwJnAdZ51jbmtgSeQxVR.jpg","production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":0,"spoken_languages":[],"status":"Released","tagline":"Forget the Troubles, Belfast's got a new problem: a city-wide bowel movement gone wild, and two unsuspecting graduates are about to wade right into it.","title":"Code Brown","video":false,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[{"aspect_ratio":0.667,"height":1477,"iso_3166_1":null,"iso_639_1":null,"file_path":"/qSGi6RfFwJnAdZ51jbmtgSeQxVR.jpg","vote_average":0,"vote_count":0,"width":985}]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}