{"id":1471164,"retrievedAt":"2025-04-27T11:29:49.492Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"","id":1471164,"imdb_id":"tt32482028","origin_country":["US"],"original_language":"en","original_title":"Chasing the Midnight Sun","overview":"What would we children do if Mother Earth were asking for help? Ivana, 53, ultrarunner and mother of three, decides to undertake an extreme feat: running 7 marathons in 4 days to reach the North Cape. Rain, altitude, cold and wind give her no respite along the Norwegian roads that she must travel to be the spokesperson of the message: \"There is no more time, we are in danger, we must do something to save the Planet\". Ivana is not alone. Her team takes care of her and the enchantment of the landscapes reminds her of the importance of her mission. But it is the presence of a woman who holds her hand when her head struggles to maintain control of her exhausted body and the lines drawn on the asphalt seem to have no end. Chasing The Midnight Sun is a documentary based on the feat IN EXTREMIS - Last Run Against Climate Change, sponsored by the Municipality of Milan, which saw Ivana di Martino as the protagonist in July 2023.","popularity":0.0071,"poster_path":"/qPfR8UabvLzuJfIPjriDjwG7Ha6.jpg","production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":66,"spoken_languages":[],"status":"Released","tagline":"Ivana, 53, ultrarunner and mother of three, decides to undertake an extreme feat: running 7 marathons in 4 days to reach the North Cape to help raise awareness for climate change","title":"Chasing the Midnight Sun","video":false,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":"tt32482028","wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[{"aspect_ratio":0.714,"height":2240,"iso_639_1":null,"file_path":"/qPfR8UabvLzuJfIPjriDjwG7Ha6.jpg","vote_average":0,"vote_count":0,"width":1600}]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}