{"id":399795,"retrievedAt":"2025-04-25T21:30:34.422Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"http://www.warwaru.com/documentary/","id":399795,"imdb_id":null,"origin_country":["US"],"original_language":"en","original_title":"Sombra di koló","overview":"A mixed-race anthropologist travels across Curaçao to expose one of the island’s biggest taboos: race and skin color, what do they mean today?  Sombra di Koló (The Shadow of Color) brings us into the world of thirty inhabitants of Dutch Caribbean island Curaçao, and shows what influence race and skin color have on their daily lives.  When visiting for the summer cultural anthropologist Angela Roe hears from her Curaçaoan aunt that she had best not bring home a dark skinned sweetheart. Upset Roe decides to investigate the underlying motives of this ‘rule:’ why has Curaçao struggled for centuries with a color hierarchy? Why is there such a strong taboo on talking about race and racism? And how do race and skin color continue to impact people today?  Her research takes her across the island, from a small village in the countryside to Spaanse Water, one of the richest neighborhoods of the island. She speaks with people about descent, class, family and Curacao’s multicultural society.","popularity":0,"poster_path":"/tIYd1GHdGlATBlOT7oLGNU9cnLm.jpg","production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":0,"spoken_languages":[],"status":"Released","tagline":"In five different neighborhoods, each distinct in their racial and class make-up, six Curaçaoans of different ages, genders and walks of life tell us what “race” and “color” mean to them today.","title":"Sombra di koló","video":false,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[{"iso_3166_1":"GB","title":"The Shadow of Color","type":""}]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[{"aspect_ratio":0.702,"height":1280,"iso_639_1":null,"file_path":"/tIYd1GHdGlATBlOT7oLGNU9cnLm.jpg","vote_average":0,"vote_count":0,"width":899}]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}