{"id":1007267,"retrievedAt":"2025-04-26T01:03:44.313Z","response":{"adult":false,"backdrop_path":null,"belongs_to_collection":null,"budget":0,"genres":[],"homepage":"https://www.pbs.org/wgbh/frontline/interview/julia-ioffe-3/","id":1007267,"imdb_id":null,"origin_country":["US"],"original_language":"en","original_title":"Putin's Road to War: Julia Ioffe (interview)","overview":"In an interview for the FRONTLINE documentary “Putin’s Road to War,” journalist Julia Ioffe discusses Vladimir Putin’s invasion of Ukraine — and why she believes the Russian leader is now “more dangerous than he’s ever been at any point in the last 22 years.”  “What he has opened up with this invasion is unthinkable,” Ioffe tells FRONTLINE. “And because he is losing and because the sanctions and the Ukrainians are humiliating him, because he is backed into a corner, he is the most dangerous he has ever been, because it is now existential for him.”  Julia Ioffe is an American journalist who was born in Russia. She is a writer for and founding partner of the media company Puck. She previously reported on politics and world affairs for The Atlantic.  This interview was conducted by FRONTLINE’s Mike Wiser on March 3, 2022. It has been edited for clarity and length.","popularity":0,"poster_path":null,"production_companies":[],"production_countries":[],"release_date":"","revenue":0,"runtime":46,"spoken_languages":[],"status":"Released","tagline":"“because he is losing and because the sanctions and the Ukrainians are humiliating him, because he is backed into a corner, he is the most dangerous he has ever been, because it is now existential for him.”","title":"Putin's Road to War: Julia Ioffe (interview)","video":true,"vote_average":0,"vote_count":0,"alternative_titles":{"titles":[]},"credits":{"cast":[],"crew":[]},"external_ids":{"imdb_id":null,"wikidata_id":null,"facebook_id":null,"instagram_id":null,"twitter_id":null},"images":{"backdrops":[],"logos":[],"posters":[]},"keywords":{"keywords":[]},"release_dates":{"results":[]},"videos":{"results":[]}}}